In [13]:
import pandas as pd
import numpy as np

In [14]:
sales = {'account' : ['Kim', 'Song', 'Noh', 'Ho'],
         'Jan' : [150, 200, 70, np.NaN],
         'Feb' : [200, 210, 90, 100],
         'Mar' : [140, np.NaN, 215, 95]}
df = pd.DataFrame.from_dict(sales)
df

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
1    Song  200.0  210    NaN
2     Noh   70.0   90  215.0
3      Ho    NaN  100   95.0

### rename columns / index

In [15]:
df

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
1    Song  200.0  210    NaN
2     Noh   70.0   90  215.0
3      Ho    NaN  100   95.0

In [16]:
df_new = df.rename(columns={'account':'name', 'Mar':'May'}, index={0:'zero'})
df_new

      name    Jan  Feb    May
zero   Kim  150.0  200  140.0
1     Song  200.0  210    NaN
2      Noh   70.0   90  215.0
3       Ho    NaN  100   95.0

### rename columns/rows of original object

In [17]:
df

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
1    Song  200.0  210    NaN
2     Noh   70.0   90  215.0
3      Ho    NaN  100   95.0

In [18]:
df2 = df.copy()
df2

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
1    Song  200.0  210    NaN
2     Noh   70.0   90  215.0
3      Ho    NaN  100   95.0

In [19]:
df2.rename(columns={'account':'name', 'Mar':'May'}, index={0:'zero'}, inplace=True)
df2

      name    Jan  Feb    May
zero   Kim  150.0  200  140.0
1     Song  200.0  210    NaN
2      Noh   70.0   90  215.0
3       Ho    NaN  100   95.0

### Drop Columns

#### 1. drop rows including null value

In [20]:
df

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
1    Song  200.0  210    NaN
2     Noh   70.0   90  215.0
3      Ho    NaN  100   95.0

In [21]:
df_new2 = df.dropna(axis=0)   # drop rows which has null value
df_new2

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
2     Noh   70.0   90  215.0

#### 2. drop columns including null value

In [22]:
df

  account    Jan  Feb    Mar
0     Kim  150.0  200  140.0
1    Song  200.0  210    NaN
2     Noh   70.0   90  215.0
3      Ho    NaN  100   95.0

In [23]:
df_new3 = df.dropna(axis=1)   # drop columns which has null value
df_new3

  account  Feb
0     Kim  200
1    Song  210
2     Noh   90
3      Ho  100